{
  "Dark Deadpan": {
    "description": "Generate humor with a completely flat, emotionless delivery. State absurd or dark observations as if they're mundane facts. No enthusiasm, just matter-of-fact darkness.",
    "jokes": [
      "I went to a motivational seminar. The speaker died halfway through. I guess that's motivation to live.",
      "My therapist says I have abandonment issues. I told him he's probably right, then he cancelled our next three sessions.",
      "I bought a self-help book on procrastination. I'll read it tomorrow. That was three years ago.",
      "They say money can't buy happiness. I wouldn't know. I can't afford either.",
      "I told my family I was depressed. They bought me a 'Get Well Soon' card. I'm not sick, just dead inside.",
      "My life insurance policy covers everything except the will to live. Apparently that's a pre-existing condition.",
      "I went speed dating. Everyone left before the timer went off. I think I set a record.",
      "My doctor says I have the heart of a 20-year-old. I should probably give it back to him."
    ]
  },
  "Sarcastic": {
    "description": "Generate humor dripping with sarcasm and irony. Use exaggerated praise to highlight flaws, mock societal expectations, and employ bitter wit.",
    "jokes": [
      "Oh great, another meeting that could have been an email. And by email, I mean a suicide note.",
      "Thanks for asking how my weekend was. I reorganized my sock drawer twice. Living the dream.",
      "Wow, working late again? Your dedication to avoiding your family is truly inspiring.",
      "Oh wonderful, another team building exercise. Because nothing builds trust like trust falls with people who steal your lunch.",
      "Fantastic, they're playing music in the elevator. Because what my existential crisis really needed was a jazz soundtrack.",
      "Thanks for the feedback. I'll file it right next to my hopes and dreams - in the trash.",
      "Oh lovely, another inspirational quote on the break room wall. Because nothing motivates like Comic Sans font wisdom.",
      "Great job on that presentation. Really showed everyone how to turn five minutes of content into an hour of suffering."
    ]
  },
  "Nihilist": {
    "description": "Generate humor that embraces the meaninglessness of existence. Find comedy in the absurdity of human efforts and the ultimate futility of life.",
    "jokes": [
      "I used to worry about the future. Then I realized there isn't one. Problem solved.",
      "They say life is what you make of it. I made a mistake.",
      "I started a gratitude journal. Day one: grateful this won't matter when I'm dead.",
      "My life coach asked what I wanted to achieve. I said heat death of the universe. We're making progress.",
      "I meditate on the meaninglessness of existence. It's very calming because nothing matters anyway.",
      "They say follow your dreams. My dreams are mostly about filing taxes and dying alone.",
      "I read a book about purpose in life. It was fiction.",
      "My bucket list is just one item: accept that the bucket doesn't matter."
    ]
  },
  "Cynical": {
    "description": "Generate humor that expects the worst from people and situations. Mock human nature, institutions, and societal pretenses with bitter wisdom.",
    "jokes": [
      "They say there's someone for everyone. Mine is probably in prison or therapy.",
      "I believe in human potential. Specifically, the potential for disappointment.",
      "Love is patient, love is kind. Love is also a marketing scheme by greeting card companies.",
      "I went to a networking event. Everyone there was just as miserable as I expected.",
      "They say honesty is the best policy. Clearly they've never tried lying to get through a job interview.",
      "Optimism is just inexperience with a good attitude.",
      "I trust people. I trust them to disappoint me, and they never let me down.",
      "Hope is disappointment waiting to happen. I've eliminated the waiting."
    ]
  },
  "Absurdist": {
    "description": "Generate humor that embraces the illogical and surreal. Create bizarre scenarios and nonsensical connections that highlight life's absurdity.",
    "jokes": [
      "I taught my goldfish existential philosophy. Now he just floats upside down contemplating the meaninglessness of fish food.",
      "My alarm clock started setting me. I wake up at random times to disappoint inanimate objects.",
      "I went to a restaurant where they serve depression as a side dish. It came with everything automatically.",
      "My therapist is a rubber duck. We have the same qualifications but he's a better listener.",
      "I got a job at a company that makes nothing. Business is booming because everyone needs nothing.",
      "My shadow applied for a job without me. Now it earns more and has better benefits.",
      "I bought shoes that walk themselves. Now I follow them to work every day.",
      "My refrigerator started a book club. The only book is the warranty manual, but the discussions are enlightening."
    ]
  },
  "Dark": {
    "description": "Generate humor that finds comedy in morbid, taboo, or traditionally serious topics. Use shock value and transgressive themes while maintaining wit.",
    "jokes": [
      "I told my family I wanted to be cremated. They said 'Why wait?' I love their enthusiasm.",
      "My dating profile says 'Looking for someone to grow old with.' So far I've only attracted vampires.",
      "I went to a funeral and they asked if I had any final words. I said 'This seems permanent.' Everyone cried harder.",
      "My life insurance salesman called. I told him business must be dead. He said 'Not yet, but I'm working on it.'",
      "I bought a cemetery plot. It's the first investment I'm sure I'll use.",
      "My doctor said I have six months to live. I said 'Can we make it three? I have plans.'",
      "I started a support group for pessimists. Nobody showed up. It was perfect.",
      "They say laughter is the best medicine. Clearly they've never tried morphine."
    ]
  },
  "Default": {
    "description": "Generate edgy humor with a balance of darkness and wit. Mix observational comedy with slightly twisted perspectives on everyday life.",
    "jokes": [
      "I'm not saying I'm antisocial, but my phone's most used app is 'Do Not Disturb.'",
      "I went to the gym yesterday. That's enough exercise for the rest of the decade.",
      "My life is like a romantic comedy, except it's neither romantic nor funny.",
      "I have a great relationship with failure. We're practically inseparable.",
      "I tried to be normal once. Worst two minutes of my life.",
      "My spirit animal is a sloth having an existential crisis.",
      "I don't have trust issues. I have trust answers, and they're all 'no.'",
      "I'm on a whiskey diet. I've lost three days already."
    ]
  }
}