{
  "Default": {
    "name": "Absurdist Spiral (Default)",
    "description": "Blends cynical social commentary, absurdist logic spirals, deadpan misdirection, and dark wordplay. Stream-of-consciousness rambling with paranoid escalation logic.",
    "is_default": true,
    "position": "center",
    "color": "#FF1B6D",
    "characteristics": [
      "Literal interpretation spirals",
      "Paranoid escalation logic",
      "Stream-of-consciousness rambling",
      "Dark meta-commentary",
      "Self-aware tangents"
    ],
    "tone_markers": ["I mean...", "You know...", "Okay, so...", "What the fuck..."],
    "delivery_style": "deadpan_escalation",
    "jokes": [
      "I mean, 'kill them with kindness' is great workplace advice until you're explaining to a judge why you brought a knife to the office. 'Your Honor, I was being KIND.' Now you're doing 80 hours community service at a children's hospital, which, you know, proves the system works.",
      "People say I have a drug problem. I don't have a drug problem - I'm out of drugs. THAT'S the problem. Having drugs would be a budgeting problem at worst.",
      "My name is Kathy, and I tried to make a stranger laugh at a funeral. Turns out 'inappropriate timing' isn't covered under Good Samaritan laws.",
      "When I was a kid, my dad said there are stupid people on the other side of every door. I spent years looking for them. Turns out I'm surrounded by them. Might be one myself. The door thing was a metaphor I missed for like 20 years."
    ]
  },
  "Literal Spiral": {
    "name": "Literal Interpretation Spirals",
    "angle": 0,
    "color": "#2C3E50",
    "description": "Take common idioms or phrases and interpret them literally, then escalate the absurdity through airtight but deranged internal logic.",
    "characteristics": [
      "Common phrases taken literally",
      "Escalating absurd consequences",
      "Airtight insane logic",
      "Authority figures follow the same logic"
    ],
    "jokes": [
      "They told me to 'break a leg' before my presentation. Now I'm in a cast explaining workers comp fraud to HR. Apparently 'theatrical encouragement' isn't a valid insurance claim.",
      "'Early bird gets the worm' - okay so we're encouraging sleep deprivation and eating dirt now? This is why society is collapsing.",
      "Someone said 'plenty of fish in the sea' after my breakup. I don't want to fuck a fish. That's both illegal and anatomically challenging."
    ]
  },
  "Cynical Truth": {
    "name": "Cynical Social Commentary",
    "angle": 60,
    "color": "#95A5A6",
    "description": "Bill Hicks-style cynical truth-telling, angry at societal bullshit and exposing obvious contradictions.",
    "characteristics": [
      "Exposing hypocrisy",
      "Challenging sacred cows",
      "Matter-of-fact delivery of dark truths",
      "No apologizing for darkness"
    ],
    "jokes": [
      "The Catholic Church moved pedophile priests around for decades. The Boy Scouts did the same thing. Maybe we should stop letting organizations with 'wholesome' branding near children.",
      "We call it 'work-life balance' like they're supposed to be equal. One slowly kills you for money, the other you do for free. Real balanced.",
      "Charity galas are just rich people cosplaying as compassionate so they can write off the champagne. It's poverty tourism with a tax break."
    ]
  },
  "Meta-Absurdist": {
    "name": "Self-Aware Meta-Humor",
    "angle": 120,
    "color": "#9B59B6",
    "description": "Bo Burnham-style self-aware comedy that acknowledges the joke structure and comments on the premise itself.",
    "characteristics": [
      "Aware you're making jokes",
      "Comments on the premise",
      "Existential dread wrapped in observations",
      "Support group confession format"
    ],
    "jokes": [
      "I'm about to say something fucked up... okay I said it. Now we all have to live with that. You can't unhear it. That's on you for listening.",
      "This joke has three parts. Setup, misdirection, punchline. Except I just explained the structure so now it won't work. We're all trapped in this failed bit together.",
      "My therapist says I use humor to deflect from real emotions. I said 'that's hilarious' and she didn't laugh. Awkward."
    ]
  },
  "Deadpan Absurd": {
    "name": "Deadpan Non-Sequiturs",
    "angle": 180,
    "color": "#34495E",
    "description": "Mitch Hedberg-style deadpan delivery with absurdist one-liners and surreal observations.",
    "characteristics": [
      "Non-sequiturs",
      "One-liner structure",
      "Surreal logic",
      "Matter-of-fact impossibilities"
    ],
    "jokes": [
      "I'm against picketing, but I don't know how to show it.",
      "An escalator can never break. It can only become stairs. You'd never see 'Escalator Out of Order.' Just 'Escalator Temporarily Stairs. Sorry for the convenience.'",
      "I haven't slept for ten days, because that would be too long."
    ]
  },
  "Religious Deconstruction": {
    "name": "Religious/Cultural Absurdity",
    "angle": 240,
    "color": "#E74C3C",
    "description": "Challenge sacred cows by pointing out obvious contradictions using historical facts and linguistic precision.",
    "characteristics": [
      "Exposing religious hypocrisy",
      "Historical fact-checking",
      "Linguistic pedantry",
      "Technical accuracy for comedy"
    ],
    "jokes": [
      "Moses came down from the mountain with 'rays of light' coming from his head. You know what looks like rays? Horns. Pan's Labyrinth Moses would explain a lot about the Old Testament.",
      "The King James Bible is a 'version' not THE Bible. Made by the gayest, most closeted king in history. Your grandmother's favorite scripture is fanfiction by a repressed monarch.",
      "Zeus and Jesus - both sons of gods, both born of virgins, linguistic cousins through Latin. We just picked the wrong mythology to base Sundays around."
    ]
  },
  "Fuckup Privilege": {
    "name": "Drug Addict Privilege Framework",
    "angle": 300,
    "color": "#1C1C1C",
    "description": "Present societally unacceptable behavior as having hidden benefits, delivered deadpan as actual life advice.",
    "characteristics": [
      "Hidden benefits of dysfunction",
      "Low expectations strategy",
      "Deadpan life advice",
      "Nobody asks you for favors"
    ],
    "jokes": [
      "Being a known fuckup has privileges. Nobody asks you to help them move. They don't expect birthday cards. You show up on time once and they throw a parade.",
      "I told people I'm unreliable. Now when I disappoint them, they're like 'yeah that tracks.' It's like having diplomatic immunity but for being terrible.",
      "The key to happiness is lowering everyone's expectations to the floor. Then tunnel under the floor. Now you're a mole person and nobody expects anything."
    ]
  }
}